#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>

* Experimental Containers
:PROPERTIES:
:header-args: :mkdirp yes :tangle ./experiment_docker/Dockerfile
:ID:       81A5C2EA-4760-47F2-BDDE-F194A765E2BB
:END:

#+BEGIN_SRC sh :tangle no
docker image ls
#+END_SRC

#+RESULTS:
| REPOSITORY             | TAG        | IMAGE        | ID | CREATED | SIZE |        |
| srds                   | latest     | f3313b691514 | 13 | hours   | ago  | 2.93GB |
| shrysr/datasciencer    | latest     | f3313b691514 | 13 | hours   | ago  | 2.93GB |
| <none>                 | <none>     | b9761ac214a5 | 13 | hours   | ago  | 2.81GB |
| umaptest               | latest     | 09ccf15c3239 | 16 | hours   | ago  | 2.91GB |
| web2                   | latest     | 7d717b392c2e |  4 | months  | ago  | 73.7MB |
| <none>                 | <none>     | 0d3af5fe4466 |  4 | months  | ago  | 73.7MB |
| <none>                 | <none>     | 63429fdd1b85 |  4 | months  | ago  | 73.7MB |
| rocker/tidyverse       | latest     | 023907c7da33 |  5 | months  | ago  | 2.1GB  |
| <none>                 | <none>     | 363837418c2b |  5 | months  | ago  | 73.7MB |
| rocker/shiny-verse     | latest     | 87397fc3e62a |  5 | months  | ago  | 1.86GB |
| <none>                 | <none>     | 53aea7a47e1a |  5 | months  | ago  | 73.7MB |
| web1                   | latest     | 1ca29acbe073 |  5 | months  | ago  | 73.1MB |
| <none>                 | <none>     | 289ce05fc9c9 |  5 | months  | ago  | 73.1MB |
| python                 | 2.7-alpine | f101ac3346a7 |  5 | months  | ago  | 61.7MB |
| redis                  | latest     | bb0ab8a99fe6 |  6 | months  | ago  | 95MB   |
| nginx                  | latest     | f68d6e55e065 |  6 | months  | ago  | 109MB  |
| ubuntu                 | latest     | 4c108a37151f |  6 | months  | ago  | 64.2MB |
| hello-world            | latest     | fce289e99eb9 | 12 | months  | ago  | 1.84kB |
| rickfast/hello-oreilly | latest     | ec347d11e305 |  3 | years   | ago  | 4.79MB |

#+BEGIN_SRC dockerfile
FROM shrysr/datasciencer as base1
FROM rocker/tidyverse
COPY  --from=base1 * .
#+END_SRC

